# Profile2OffsetY Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Profile2OffsetY Property
ParameterTypeId Class See Also
---
"Vertical Profile Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Profile2OffsetY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Profile2OffsetY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Profile2OffsetY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace